app/Controllers/Home.php

SELECT *
FROM `short_urls`
WHERE `id` = '51'
 LIMIT 1
---
    public function showEditUrl($id = null) {
        $GenUrlModel = new GenerateShortUrlModel();
        $data['url_obj'] = $GenUrlModel->where('id', $id)->first();