app/Models/GenerateShortUrlModel.php

    public function getAll()
    {
        return $this->findAll();
---
SELECT *
FROM `short_urls`

    public function getByCode($code)
    {
        return $this->where('short_code', $code)->first();
---
SELECT *
FROM `short_urls`
WHERE `short_code` = '40AT5yx'
 LIMIT 1

    function add($data)
    {
        return $this->db
            ->table($this->table)
            ->insert($data);
---
INSERT INTO `short_urls` (`long_url`, `short_code`, `hits`, `created`) VALUES ('https://facebook.com', '40AT5yx', 1, '2022-11-09 10:50:50pm')

    function updateData($short_code, $data)
    {
        return $this->db
            ->table($this->table)
            ->where(["short_code" => $short_code])
            ->set($data)
            ->update();
---
UPDATE `short_urls` SET `hits` = 2
WHERE `short_code` = '40AT5yx'